FROM jenkins/jenkins:lts

# Устанавливаем Maven
USER root #Эта строка переключает пользователя в контейнере на root.
#меняет текущего пользователя, под которым выполняются следующие команды в Dockerfile.
#root — имя пользователя. В данном случае,
#root предоставляет права суперпользователя для выполнения следующих команд, таких как установка пакетов.

RUN apt-get update && apt-get install -y maven # Эта строка выполняет команды обновления списка пакетов и установки Maven в контейнере.
#RUN — Docker-инструкция, используемая для выполнения команд оболочки внутри контейнера во время создания образа.
#apt-get update — команда обновления индекса пакетов apt, которая загружает самую последнюю информацию о доступных пакетах и их версиях.
#Это нужно сделать перед установкой любого нового пакета, чтобы убедиться, что мы устанавливаем последние версии.
#apt-get install -y maven — команда установки Maven через пакетный менеджер apt. Флаг -y автоматически отвечает "yes" на
#все вопросы установки, чтобы избежать блокировки установки в интерактивном режиме.

# Переключаемся обратно на jenkins пользователя
USER jenkins